{
    "Cours": [
        {
            "titre":"Introduction",
            "id": 0,
            "sousTitre": "",
            "contenu": "Linux Mint est ce qu'on appelle un système d'exploitation (OS). Un OS est un ensemble de programmes qui permettent le fonctionnement et l’utilisation des principales ressources de l’ordinateur (mémoire, disque dur, processeur). Windows est aussi un système d'exploitation. SI vous avez un problème avec votre poste de travail, voici la marche à suivre:",
            "points":[
                {
                    "point":"le signaler à votre direction, qui contactera la DSI (=le support informatique)"
                },
                {
                    "point":"contacter la DSI au 04 76 86 31 31"
                },
                {
                    "point":"ou via assistance.informatique.ecole@grenoble.fr"
                },
                {
                    "point":"Dans tous les cas, veillez à transmettre : le n° de salle et le n° du poste"
                }
            ],
            "lien":"icône « assistance informatique » sur le bureau de votre poste contient toutes les informations nécessaires pour répondre à la DSI lors d'un dépannage",
            "conclusion": "De même, si vous souhaitez installer un logiciel (y compris logiciels éducatifs comme SCRATCH)*, une police d'écriture, etc.. sur votre poste, assurez-vous qu'il s'agit d'un « logiciel libre » et compatible avec Linux Mint, puis faites une demande à la DSI. Cela vaut aussi pour obtenir un lecteur CD-ROMS car votre ordinateur n'en possède pas."            
        },
        {
            "titre": "Chapitre 1",
            "id": 1,
            "sousTitre": "Se repérer dans l'environnement",
            "contenu": "Lorsque l'ordinateur s'allume, vous êtes sur le bureau, où vous trouverez l'icône « assistance informatique » et le menu Démarrer. tous les logiciels éducatifs installés sur vote poste se trouvent dans le menu Démarrer. Lorsque vous êtes dans un dossier, l’arborescence (la liste des dossiers et fichiers à gauche) montre plusieurs dossiers. Les plus importants sont :", 
            "points":[
                {
                    "point": "« Confidentiel » : ce dossier est partagé par tous les professeurs et la direction. Toutes les personnes qui y ont accès peuvent modifier ou supprimer les documents qui s'y trouvent. Les élèves n'y ont pas accès."
                },
                {
                    "point": "« Scan » : les documents numérisés sont envoyés automatiquement dans ce dossier."
                },
                {
                    "point": "Dossiers des classes « CP, « CE1/CE2, « CM1/CM2 » contiennent chacun un dossier « « Profs » et un dossier « Elèves ». - « Profs » : Les élèves peuvent voir et travailler directement sur les documents stockés dans « Profs », mais ils ne peuvent pas en modifier la source ou les supprimer. Rappel : Pour sauvegarder, les élèves cliquent sur « enregistrer sous », et leur document est enregistré automatiquement dans le dossier Elèves. - « Elèves » : dans ce dossier, les élèves peuvent tout faire, y compris supprimer ou modifier le travail de leurs camarades ! Par conséquent, il est important de les amener à être vigilants sur ce dernier point. Également, à titre préventif, il est conseillé de prendre les documents stockés dans « Elèves » lorsqu’ils sont terminés et de les archiver dans « Profs » afin de les protéger d’une éventuelle suppression ou modification de la part d’un élève."
                }
            ],
            "lien":"Il est important de ne pas enregistrer ses documents directement sur le bureu de l’ordinateur sur lequel on travaille : en cas de problème technique sur l’ordinateur ou de changement de poste, les données stockées seront perdues. Les sauvegardes doivent être faites sur le serveur de l’école (les dossiers ci-dessus) et / ou sur le bureau, mais jamais uniquement sur le bureau",
            "conclusion": "Pour stocker vous documents en ligne afin d'y avoir accès depuis chez vous, la DSI recommande Nextcloud. Similaire à Google Drive, cette platerformea une version spéciale pour les professeurs (Cf. Chapitre 2)."            
        },
        {
            "titre": "Chapitre 2",
            "id": 2,
            "sousTitre": " Sauvegarder sur Nextcloud ",
            "contenu": "Nexcloud est un service cloud (hébergement de fichiers en ligne) proposé par le Ministère de l’Education Nationale. Il met à disposition une espace de stockage en ligne sécurisé pour diffuser et partager des documents et des ressources téléchargeables à partir d’un poste de travail ou d’un appareil mobile. Accessible après la création d’un compte personnel grâce à votre mail académique, ce service facilite le travail collaboratif entre les personnels de l’Education Nationale. Il répond aux conditions préconisées dans le cadre du règlement général de la protection des données (RGPD).",
            "points": [
                {
                    "point":"En tant qu’enseignant, vous disposez d’un espace de stockage de 1Go avec des dossiers à organiser. Vous pouvez partager un dossier ou des fichiers facilement et envoyer le lien à vos élèves."
                },
                {
                    "point": "L’élève peut rendre des travaux en utilisant un lien, unique, lié à un dossier de l’espace de l’enseignant."
                },
                {
                    "point": "Vous devez préalablement créer un compte sur le portail apps.education.fr si vous n’en possédez pas encore un."
                }
            ],             
            "lien" : "https://apps.education.fr/plateforme/lyon/",
            "conclusion":"C'est une solution efficace qui protège mieux pour protéger vos données et celles des élèves."
        },
        {
            "titre": "Chapitre 3",
            "id": 3,
            "sousTitre": "Identifier les icônes",
            "contenu": "Une icône est un symbole graphique affiché sur l'écran d'un ordinateur et correspondant, au sein d'un logiciel, à l'exécution d'une tâche particulière.(source : Dictionnaire Larousse). D’un système d’exploitation à un autre, les tâches à réaliser les plus fréquentes sont identiques : ouvrir un fichier, lancer un logiciel, afficher un contenu, etc... Elles peuvent se trouver à différents emplacements : rur le bureau, dans le menu démarrer, sur la barre de tâches et dans les fenêtres. Pour comprendre la signification des icônes de Linux, commençons par revoir celles de Windows. Il existe 5 grandes familles d’icônes : ",
            "points":[
                {
                    "point" : "les fichiers (word, excel, pdf, powerpoint)"
                },
                {
                    "point" : "les dossiers (Mes documents, Ma Musique, Mes images, etc...)"
                },
                {
                    "point" : "les espaces de stockage (disque C:, périphérique USB, etc...)"
                },
                {
                    "point" : "les raccourcis"
                },
                {
                    "point": "les programmes et logiciels (Zoom, Skype, Paint, Scratch, VLC, Adibou, MSN Messenger)"
                },
                {
                    "point" : "Autres : menu Démarrer, navigateur (Google, Firefox, Internet explorer)"
                }
            ],
            "lien":"",
            "conclusion":"Si vous connaissez les icônes de Windows, alors vous êtes prêt pour découvrir celles de Linux !"
        },
        {
            "titre" : "Chapitre 4",
            "id": 4,
            "sousTitre": "Les icônes de Linux et leur signification",
            "contenu" :"Comme pour Windows, les icônes de Linux peuvent se trouver à différents emplacements : sur le bureau, dans le menu démarrer, sur la barre de tâches et dans les fenêtres. Les familles d'icônes sont les mêmes que pour windows, mais les noms des logiciels, fichiers, etc... peuvent être différents. Nous aborderons ici les ",
            "points":[
                {
                    "point" : "l'équivalent ce qu'on appelle la suite Microsoft Office (qui donne notamment accès à Word, Excel, Powerpoint) est LibrOffice. Chaque logiciel de Microsoft Office a un équivalent LibrOffice : Writer (Word), Calc (Excel), Impress (Powerpoint). Les icônes sont très similaires à celles que l'on voit sous windows"                },
                {
                    "point" : "Le lecteur de musique et de vidéos par défaut se nomme RhythmBox, mais VLC (et bien d'autres) peut également fonctionner sur Linux"
                },
                {
                    "point" : "les icônes des dossiers de Linux Mint sont très similaires à celles de windows"
                },
                {
                    "point" : "De même que l'icône du menu Démarrer de Windows est symbolisée par le logo de windows, le menu Démarrer de Linux Mint est le logo de Linux Mint"
                },
                {
                    "point": "Le logiciel de dessin par défaut (équivalent de Paint) se nomme Drawing"
                },
                {
                    "point":"les programmes et logiciels tels que Zoom, Scratch, Skype, etc... sont les mêmes que sur Windows et leurs icônes sont les mêmes également"
                },
                {
                    "point":"Le navigateur par défaut est Mozilla Firefox"
                }

            ],
            "lien": "",
            "conclusion":""
        }
    ]
}